case1_2/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    frontandback
    {
        type            empty;
    }
    upperwall
    {
        type            symmetry;
    }
    lowerwall
    {
        type            symmetry;
    }
    pipe1
    {
        type            calculated;
        value           nonuniform List<scalar> 
176
(
19.2052
19.2052
40.3792
40.3792
24.9301
31.3897
24.9301
31.3897
...
)
;
    }
    pipe2
    {
        type            calculated;
        value           nonuniform List<scalar> 
176
(
38.6349
38.6349
46.3198
38.0052
38.5831
38.5831
29.3801
17.2741
...
)
;
    }
}


// ************************************************************************* //
